{
  "person": {
    "role": "Web & Frontend Developer"
  },
  "newsletter": {
    "title": "Subscribe to {firstName}'s Newsletter",
    "description": "I occasionally write about design, technology, and share thoughts on the intersection of creativity and engineering",
    "button": "Sign up"
  },
  "home": {
    "label": "Home",
    "title": "{name}'s Portfolio",
    "description": "Portfolio website showcasing my work as a {role}",
    "headline": "Web & Frontend Developer",
    "subline": "I'm Mostafa, a Web & Frontend Developer, where I craft intuitive user experiences."
  },
  "about": {
    "label": "About",
    "title": "About me",
    "description": "Meet {name}, {role} from {location}",
    "intro": {
      "title": "Introduction",
      "description": "Mostafa is a Istanbul-based Web & Frontend Developer with a passion for transforming complex challenges into simple, elegant design solutions. Her work spans digital interfaces, interactive experiences, and the convergence of design and technology."
    },
    "work": {
      "title": "Work Experience",
      "experiences": {
        "LARSA LLC": {
          "timeframe": "2020 - 2024",
          "role": "Senior Web & Frontend Developer",
          "achievements": "Developed and maintained responsive, high-performance web applications using React, Next.js, Tailwind CSS, and Bootstrap. Led projects for dynamic websites and e-commerce platforms on CMS platforms like WordPress (ACF, WooCommerce), PrestaShop, and Drupal, with integrated APIs and."
        },
        "Creativ3": {
          "timeframe": "2018 - 2020",
          "role": "Web Developer",
          "achievements": "Specializing in WordPress development, delivered customized websites for various clients, enhancing their online presence and performance. Develop dynamic content themes using ACF, customized plugins, and optimized websites for better speed and SEO performance."
        }
      }
    },
    "studies": {
      "title": "Studies",
      "institutions": {
        "University of Beykoz Istanbul": {
          "description": "MS Computer Engineering"
        },
        " Payame Noor University": {
          "description": "BS Information Technology Engineering"
        }
      }
    },
    "technical": {
      "title": "Technical Skills",
      "skills": {
        "Frontend": {
          "description": "Proficient in HTML, CSS, Bootstrap, Tailwind CSS, and JavaScript for building responsive and interactive user interfaces."
        },
        "APIs": {
          "description": "Experienced in Microservice API Integration using tools and libraries like Postman, Axios, Isomorphic-fetch, SendGrid, and Stripe."
        },
        "Libraries": {
          "description": "Skilled with modern libraries and frameworks, including React, Next.js, Redux, i18n, jQuery, Swiper, and GSAP for advanced functionality and animations."
        },
        "CMS & Platforms": {
          "description": "Experienced with WordPress (Theme Development, ACF, WooCommerce), PrestaShop, and Drupal for dynamic content management and e-commerce solutions."
        },
        "Backend & Database": {
          "description": "Knowledgeable in PHP, phpMyAdmin, Express, and MongoDB for server-side programming and database management."
        },
        "Version Control": {
          "description": "Experienced with Git and GitLab for version control and collaborative development workflows."
        },
        "Design Tools": {
          "description": "Proficient with Figma, Adobe XD, and Illustrator for design prototyping and UI/UX design."
        },
        "Project Management & Collaboration": {
          "description": "Familiar with Jira and Trello for project management and team collaboration."
        },
        "Hosting & Deployment": {
          "description": "Experienced in using Docker, cPanel, Plesk, and FTP for web hosting and deployment."
        }
      }
    }
  },
  "blog": {
    "label": "Blog",
    "title": "Writing about design and tech...",
    "description": "Read what {name} has been up to recently"
  },
  "work": {
    "label": "Work",
    "title": "My projects",
    "description": "Design and dev projects by {name}"
  },
  "gallery": {
    "label": "Gallery",
    "title": "My photo gallery",
    "description": "A photo collection by {name}"
  },
  "projectCard": {
    "label": "Read Case Study"
  }
}
